haymanmk/stm32f7xx_grbl/Core/Src/main.c
  /* Called if a call to pvPortMalloc() fails because there is insufficient
  free memory available in the FreeRTOS heap.  pvPortMalloc() is called
  internally by FreeRTOS API functions that create tasks, queues, software
  timers, and semaphores.  The size of the FreeRTOS heap is set by the
  configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */
  ulMallocFailures++;

  vLoggingPrintf("Malloc failed %d times\n", ulMallocFailures);
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
  (void)pcTaskName;
  (void)xTask;

  /* Run time stack overflow checking is performed if
  configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
  function is called if a stack overflow is detected. */
  taskDISABLE_INTERRUPTS();
  for (;;)
    ;
}

void vApplicationIdleHook(void)
{
  // vLoggingPrintf("Idle Hook\n");

  // check if delete task semaphore is not null
  if (deleteTaskSemaphoreHandle != NULL)
  {
    // give the semaphore to delete the task
    xSemaphoreGive(deleteTaskSemaphoreHandle);
  }
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if ((GPIO_Pin & LIMIT_MASK) != 0)
  {
    // triggered is low and not triggered is high by default
    IO_TYPE pinState = (LIMIT_PIN & LIMIT_MASK) ^ LIMIT_MASK;

    // determine whether to trigger limit pin isr or not
    // with taking into consideration the inverted pin mask
    // if it is defined.
#ifdef INVERT_LIMIT_PIN_MASK
    pinState ^= INVERT_LIMIT_PIN_MASK;
#endif
    if ((pinState & GPIO_Pin) && !(stepBlockedAxes & (1 << GET_AXIS_FROM_GPIO_PIN(GPIO_Pin))))
      limits_isr(GPIO_Pin);
  }
  else if ((GPIO_Pin & CONTROL_MASK) != 0)
  {
    // triggered is low and not triggered is high by default
    // in order to detect the trigger we need to invert the pin state
    IO_TYPE pinState = (CONTROL_PIN & CONTROL_MASK) ^ CONTROL_MASK;

    // determine whether to trigger control pin isr or not
    // with taking into consideration the inverted pin mask
    // if it is defined.
#ifdef INVERT_CONTROL_PIN_MASK
    pinState ^= INVERT_CONTROL_PIN_MASK;
#endif
    if ((pinState & GPIO_Pin) && (sys_rt_exec_alarm != EXEC_ALARM_EMG_STOP))
      system_control_pin_isr(GPIO_Pin);

    /**
     * TODO: Debounce the control pins
     */
    // if (utilsDebouncePin(CONTROL_GPIO_GROUP, GPIO_Pin, 10, GPIO_PIN_RESET) == HAL_OK)
    // {
    //   system_control_pin_isr(GPIO_Pin);
    // }
  }
  else if ((GPIO_Pin & PROBE_MASK) != 0)
  {
    if (sys_probe_state == PROBE_ACTIVE) // probing is on going
    {
      probe_state_monitor();
    }
  }
}

void startWWDG()
{
  wwdgStartFlag = 1;
  MX_WWDG_Init();
}
/* USER CODE END 4 */

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM6 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
  else if (htim->Instance == TIM7)
  {
    encoderInterruptHandler();
  }
  else if (htim->Instance == TIM14)
  {
    utilsUsTimerInterruptHandler();
  }

  /* USER CODE END Callback 1 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
